




#+BEGIN_SRC sh
# View all tty ports that are relevant
ls -l /dev/tty*
#+END_SRC

#+RESULTS:
| crw-rw-rw- 1 root          tty     5 | 0 Jul 29 18:22 /dev/tty     |
| crw--w---- 1 root          tty     4 | 0 Jul 26 22:31 /dev/tty0    |
| crw--w---- 1 root          tty     4 | 1 Jul 29 17:10 /dev/tty1    |
| crw--w---- 1 root          tty     4 | 10 Jul 29 18:18 /dev/tty10  |
| crw--w---- 1 root          tty     4 | 11 Jul 26 22:31 /dev/tty11  |
| crw--w---- 1 root          tty     4 | 12 Jul 26 22:31 /dev/tty12  |
| crw--w---- 1 root          tty     4 | 13 Jul 26 22:31 /dev/tty13  |
| crw--w---- 1 root          tty     4 | 14 Jul 26 22:31 /dev/tty14  |
| crw--w---- 1 root          tty     4 | 15 Jul 26 22:31 /dev/tty15  |
| crw--w---- 1 root          tty     4 | 16 Jul 26 22:31 /dev/tty16  |
| crw--w---- 1 root          tty     4 | 17 Jul 26 22:31 /dev/tty17  |
| crw--w---- 1 root          tty     4 | 18 Jul 26 22:31 /dev/tty18  |
| crw--w---- 1 root          tty     4 | 19 Jul 26 22:31 /dev/tty19  |
| crw--w---- 1 grokkingstuff tty     4 | 2 Jul 26 22:31 /dev/tty2    |
| crw--w---- 1 root          tty     4 | 20 Jul 26 22:31 /dev/tty20  |
| crw--w---- 1 root          tty     4 | 21 Jul 26 22:31 /dev/tty21  |
| crw--w---- 1 root          tty     4 | 22 Jul 26 22:31 /dev/tty22  |
| crw--w---- 1 root          tty     4 | 23 Jul 26 22:31 /dev/tty23  |
| crw--w---- 1 root          tty     4 | 24 Jul 26 22:31 /dev/tty24  |
| crw--w---- 1 root          tty     4 | 25 Jul 26 22:31 /dev/tty25  |
| crw--w---- 1 root          tty     4 | 26 Jul 26 22:31 /dev/tty26  |
| crw--w---- 1 root          tty     4 | 27 Jul 26 22:31 /dev/tty27  |
| crw--w---- 1 root          tty     4 | 28 Jul 26 22:31 /dev/tty28  |
| crw--w---- 1 root          tty     4 | 29 Jul 26 22:31 /dev/tty29  |
| crw--w---- 1 root          tty     4 | 3 Jul 26 22:31 /dev/tty3    |
| crw--w---- 1 root          tty     4 | 30 Jul 26 22:31 /dev/tty30  |
| crw--w---- 1 root          tty     4 | 31 Jul 26 22:31 /dev/tty31  |
| crw--w---- 1 root          tty     4 | 32 Jul 26 22:31 /dev/tty32  |
| crw--w---- 1 root          tty     4 | 33 Jul 26 22:31 /dev/tty33  |
| crw--w---- 1 root          tty     4 | 34 Jul 26 22:31 /dev/tty34  |
| crw--w---- 1 root          tty     4 | 35 Jul 26 22:31 /dev/tty35  |
| crw--w---- 1 root          tty     4 | 36 Jul 26 22:31 /dev/tty36  |
| crw--w---- 1 root          tty     4 | 37 Jul 26 22:31 /dev/tty37  |
| crw--w---- 1 root          tty     4 | 38 Jul 26 22:31 /dev/tty38  |
| crw--w---- 1 root          tty     4 | 39 Jul 26 22:31 /dev/tty39  |
| crw--w---- 1 root          tty     4 | 4 Jul 26 22:31 /dev/tty4    |
| crw--w---- 1 root          tty     4 | 40 Jul 26 22:31 /dev/tty40  |
| crw--w---- 1 root          tty     4 | 41 Jul 26 22:31 /dev/tty41  |
| crw--w---- 1 root          tty     4 | 42 Jul 26 22:31 /dev/tty42  |
| crw--w---- 1 root          tty     4 | 43 Jul 26 22:31 /dev/tty43  |
| crw--w---- 1 root          tty     4 | 44 Jul 26 22:31 /dev/tty44  |
| crw--w---- 1 root          tty     4 | 45 Jul 26 22:31 /dev/tty45  |
| crw--w---- 1 root          tty     4 | 46 Jul 26 22:31 /dev/tty46  |
| crw--w---- 1 root          tty     4 | 47 Jul 26 22:31 /dev/tty47  |
| crw--w---- 1 root          tty     4 | 48 Jul 26 22:31 /dev/tty48  |
| crw--w---- 1 root          tty     4 | 49 Jul 26 22:31 /dev/tty49  |
| crw--w---- 1 root          tty     4 | 5 Jul 26 22:31 /dev/tty5    |
| crw--w---- 1 root          tty     4 | 50 Jul 26 22:31 /dev/tty50  |
| crw--w---- 1 root          tty     4 | 51 Jul 26 22:31 /dev/tty51  |
| crw--w---- 1 root          tty     4 | 52 Jul 26 22:31 /dev/tty52  |
| crw--w---- 1 root          tty     4 | 53 Jul 26 22:31 /dev/tty53  |
| crw--w---- 1 root          tty     4 | 54 Jul 26 22:31 /dev/tty54  |
| crw--w---- 1 root          tty     4 | 55 Jul 26 22:31 /dev/tty55  |
| crw--w---- 1 root          tty     4 | 56 Jul 26 22:31 /dev/tty56  |
| crw--w---- 1 root          tty     4 | 57 Jul 26 22:31 /dev/tty57  |
| crw--w---- 1 root          tty     4 | 58 Jul 26 22:31 /dev/tty58  |
| crw--w---- 1 root          tty     4 | 59 Jul 26 22:31 /dev/tty59  |
| crw--w---- 1 root          tty     4 | 6 Jul 26 22:31 /dev/tty6    |
| crw--w---- 1 root          tty     4 | 60 Jul 26 22:31 /dev/tty60  |
| crw--w---- 1 root          tty     4 | 61 Jul 26 22:31 /dev/tty61  |
| crw--w---- 1 root          tty     4 | 62 Jul 26 22:31 /dev/tty62  |
| crw--w---- 1 root          tty     4 | 63 Jul 26 22:31 /dev/tty63  |
| crw--w---- 1 gdm           tty     4 | 7 Jul 26 22:31 /dev/tty7    |
| crw--w---- 1 root          tty     4 | 8 Jul 26 22:31 /dev/tty8    |
| crw--w---- 1 root          tty     4 | 9 Jul 26 22:31 /dev/tty9    |
| crw-rw---- 1 root          dialout 4 | 64 Jul 26 22:31 /dev/ttyS0  |
| crw-rw---- 1 root          dialout 4 | 65 Jul 26 22:31 /dev/ttyS1  |
| crw-rw---- 1 root          dialout 4 | 74 Jul 26 22:31 /dev/ttyS10 |
| crw-rw---- 1 root          dialout 4 | 75 Jul 26 22:31 /dev/ttyS11 |
| crw-rw---- 1 root          dialout 4 | 76 Jul 26 22:31 /dev/ttyS12 |
| crw-rw---- 1 root          dialout 4 | 77 Jul 26 22:31 /dev/ttyS13 |
| crw-rw---- 1 root          dialout 4 | 78 Jul 26 22:31 /dev/ttyS14 |
| crw-rw---- 1 root          dialout 4 | 79 Jul 26 22:31 /dev/ttyS15 |
| crw-rw---- 1 root          dialout 4 | 80 Jul 26 22:31 /dev/ttyS16 |
| crw-rw---- 1 root          dialout 4 | 81 Jul 26 22:31 /dev/ttyS17 |
| crw-rw---- 1 root          dialout 4 | 82 Jul 26 22:31 /dev/ttyS18 |
| crw-rw---- 1 root          dialout 4 | 83 Jul 26 22:31 /dev/ttyS19 |
| crw-rw---- 1 root          dialout 4 | 66 Jul 26 22:31 /dev/ttyS2  |
| crw-rw---- 1 root          dialout 4 | 84 Jul 26 22:31 /dev/ttyS20 |
| crw-rw---- 1 root          dialout 4 | 85 Jul 26 22:31 /dev/ttyS21 |
| crw-rw---- 1 root          dialout 4 | 86 Jul 26 22:31 /dev/ttyS22 |
| crw-rw---- 1 root          dialout 4 | 87 Jul 26 22:31 /dev/ttyS23 |
| crw-rw---- 1 root          dialout 4 | 88 Jul 26 22:31 /dev/ttyS24 |
| crw-rw---- 1 root          dialout 4 | 89 Jul 26 22:31 /dev/ttyS25 |
| crw-rw---- 1 root          dialout 4 | 90 Jul 26 22:31 /dev/ttyS26 |
| crw-rw---- 1 root          dialout 4 | 91 Jul 26 22:31 /dev/ttyS27 |
| crw-rw---- 1 root          dialout 4 | 92 Jul 26 22:31 /dev/ttyS28 |
| crw-rw---- 1 root          dialout 4 | 93 Jul 26 22:31 /dev/ttyS29 |
| crw-rw---- 1 root          dialout 4 | 67 Jul 26 22:31 /dev/ttyS3  |
| crw-rw---- 1 root          dialout 4 | 94 Jul 26 22:31 /dev/ttyS30 |
| crw-rw---- 1 root          dialout 4 | 95 Jul 26 22:31 /dev/ttyS31 |
| crw-rw---- 1 root          dialout 4 | 68 Jul 26 22:31 /dev/ttyS4  |
| crw-rw---- 1 root          dialout 4 | 69 Jul 26 22:31 /dev/ttyS5  |
| crw-rw---- 1 root          dialout 4 | 70 Jul 26 22:31 /dev/ttyS6  |
| crw-rw---- 1 root          dialout 4 | 71 Jul 26 22:31 /dev/ttyS7  |
| crw-rw---- 1 root          dialout 4 | 72 Jul 26 22:31 /dev/ttyS8  |
| crw-rw---- 1 root          dialout 4 | 73 Jul 26 22:31 /dev/ttyS9  |



For Unix users, execute this command in a terminal
#+BEGIN_SRC sh
sudo usermod -a -G dialout <username>
#+END_SRC

#+BEGIN_SRC ipython :session
import serial

#print(serial.__file__)
import csv
#+END_SRC

#+RESULTS:
: # Out[40]:


#+BEGIN_SRC ipython :session

# For Windows
serialInterface = '/dev/tty.wchusbserial1420'
print(dir(serial))
arduino = serial.Serial( serialInterface , 115200, timeout=.1)
#+END_SRC

#+RESULTS:
: # Out[36]:


#+BEGIN_SRC ipython :session
data = arduino.readline()[:-2]

with open("test.txt", "a") as myfile:
    while data is not 'stop':

	      if data:
            myfile.write(data)

        data = arduino.readline()[:-2] #the last bit gets rid of the new-line chars
#+END_SRC

